src/src/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountingMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LinesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CountryOfOrigin</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpensesGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuaranteePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HSCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HSCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InventoryGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderCompletionDeadline</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsCategory</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplenishmentDeadline</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplenishmentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryReplenishmentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Specification</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TimeNorm</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseBatches</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseCharacteristics</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseSerialNumbers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOutTheGuaranteeCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsFreightService</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/AccumulationRegisters/InventoryInWarehouses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>InventoryInWarehouses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/Enums/ProductsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ProductsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InventoryItem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Work</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Operation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WorkKind</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/Products/Forms/ListForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtClient
Procedure ChangeSelected(Command)
	GroupObjectsChangeClient.ChangeSelected(Items.List);
EndProcedure

&AtClient
Procedure FilterBalancesOnChange(Item)
	SetFilterParametersServer();
EndProcedure

&AtClient
Procedure FilterWarehouseOnChange(Item)
	SetFilterParametersServer();
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SetFilterParametersServer();;
	
	// StandardSubsystems.GroupObjectsChange
	If Items.Find("ListBatchObjectChanging") <> Undefined Then
		
		YouCanEdit = AccessRight("Edit", Metadata.Catalogs.Products);
		CommonUseClientServer.SetFormItemProperty(Items, "ListBatchObjectChanging", "Visible", YouCanEdit);
		
	EndIf;
	// End StandardSubsystems.GroupObjectChange
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisForm);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.DataImportFromExternalSources
	DataImportFromExternalSources.OnCreateAtServer(Metadata.Catalogs.Products, DataLoadSettings, ThisObject);
	// End StandardSubsystems.DataImportFromExternalSource
	
	Items.FormDataImportFromExternalSources.Visible = AccessRight("Use", Metadata.DataProcessors.DataImportFromExternalSources);
	
EndProcedure

&AtClient
Procedure ShowBalancesOnChange(Item)
	SetFilterParametersServer();
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure SetFilterParametersServer()
	
	UseQuantityInList = FilterBalances <> 0 OR ShowBalances;
	
	SetQueryTextList();
	SetListFilterItemBalances(List, FilterBalances);
	SetListQueryParameters();
	SetVisibleEnabled();
	
EndProcedure

&AtServer
Procedure SetListFilterItemBalances(ListForFilter, FilterBalances)
	
	UseFilter = FilterBalances <> 0;
	
	If FilterBalances = 2 Then
		FilterComparisonType = DataCompositionComparisonType.LessOrEqual; 
	Else
		FilterComparisonType = DataCompositionComparisonType.Greater;
	EndIf;
	
	DriveClientServer.SetListFilterItem(ListForFilter, "QuantityBalance", 0, UseFilter, FilterComparisonType);
		
EndProcedure

&AtServer
Procedure SetListQueryParameters()
	
	CommonUseClientServer.SetDynamicListParameter(List, "Period", CurrentSessionDate());
	
	If FilterBalances = 2 Then
		CommonUseClientServer.SetDynamicListParameter(List, "AllTypes",	False);
	Else
		CommonUseClientServer.SetDynamicListParameter(List, "AllTypes",	True);
	EndIf;

	If ValueIsFilled(FilterWarehouse) Then
		CommonUseClientServer.SetDynamicListParameter(List, "AllWarehouses",	False);
		CommonUseClientServer.SetDynamicListParameter(List, "Warehouse",		FilterWarehouse);
	Else
		CommonUseClientServer.SetDynamicListParameter(List, "AllWarehouses",	True);
		CommonUseClientServer.SetDynamicListParameter(List, "Warehouse",		PredefinedValue("Catalog.BusinessUnits.EmptyRef"));
	EndIf; 
	
EndProcedure

&AtServer
Procedure SetVisibleEnabled()
	
	Items.FilterWarehouse.Visible	= (FilterBalances = 1);
	Items.Balance.Visible			= ShowBalances;
	
EndProcedure

&AtServer
Function SetQueryTextList()
	
	List.QueryText = 
	"SELECT
	|	CatalogProducts.Ref AS Ref,
	|	CatalogProducts.Ref AS Products,
	|	CatalogProducts.DeletionMark,
	|	CatalogProducts.Parent,
	|	CatalogProducts.IsFolder,
	|	CatalogProducts.Code,
	|	CatalogProducts.Description,
	|	CatalogProducts.SKU,
	|	CatalogProducts.ChangeDate,
	|	CAST(CatalogProducts.DescriptionFull AS STRING(1000)) AS DescriptionFull,
	|	CatalogProducts.BusinessLine,
	|	CatalogProducts.ProductsCategory,
	|	CatalogProducts.Vendor,
	|	CatalogProducts.Warehouse,
	|	CatalogProducts.ReplenishmentMethod,
	|	CatalogProducts.ReplenishmentDeadline,
	|	CatalogProducts.VATRate,
	|	CatalogProducts.ProductsType,
	|	CatalogProducts.Cell,
	|	CatalogProducts.PriceGroup,
	|	CatalogProducts.UseCharacteristics,
	|	CatalogProducts.UseBatches AS UseReservation,
	|	CatalogProducts.UseBatches AS UseBatches,
	|	CatalogProducts.OrderCompletionDeadline,
	|	CatalogProducts.TimeNorm,
	|	CatalogProducts.CountryOfOrigin,
	|	CatalogProducts.UseSerialNumbers,
	|	CatalogProducts.GuaranteePeriod,
	|	CatalogProducts.WriteOutTheGuaranteeCard,
	|	Substring(CatalogProducts.Comment, 1, 1000) AS Comment,
	|	CatalogProducts.MeasurementUnit AS MeasurementUnit,
	|	0 AS Price,
	|	&Period";
	
	If UseQuantityInList Then
		List.QueryText = List.QueryText + "
		|	, ISNULL(InventoryInWarehouses.QuantityBalance, 0) AS QuantityBalance";
	Else
		List.QueryText = List.QueryText + "
		|	, 0 AS QuantityBalance";		
	EndIf;
	
	List.QueryText = List.QueryText + "
	|FROM
	|	Catalog.Products AS CatalogProducts";
	
	If UseQuantityInList Then
		List.QueryText = List.QueryText + "
		|		LEFT JOIN AccumulationRegister.InventoryInWarehouses.Balance(
		|		,
		|		&AllWarehouses
		|				OR StructuralUnit = &Warehouse) AS InventoryInWarehouses
		|		ON (InventoryInWarehouses.Products = CatalogProducts.Ref)";
	EndIf;
	
	List.QueryText = List.QueryText + "
	|	WHERE &AllTypes 
	|		OR CatalogProducts.ProductsType = VALUE(Enum.ProductsTypes.InventoryItem)";
	
EndFunction

#EndRegion

#Region LibrariesHandlers

// StandardSubsystems.DataImportFromExternalSources
&AtClient
Procedure DataImportFromExternalSources(Command)
	
	NotifyDescription = New NotifyDescription("ImportDataFromExternalSourceResultDataProcessor", ThisObject, DataLoadSettings);
	
	DataLoadSettings.Insert("TemplateNameWithTemplate",	"LoadFromFile");
	DataLoadSettings.Insert("SelectionRowDescription",	New Structure("FullMetadataObjectName, Type", "Products", "AppliedImport"));
	
	DataImportFromExternalSourcesClient.ShowDataImportFormFromExternalSource(DataLoadSettings, NotifyDescription, ThisObject);
	
EndProcedure

&AtClient
Procedure ImportDataFromExternalSourceResultDataProcessor(ImportResult, AdditionalParameters) Export
	
	If TypeOf(ImportResult) = Type("Structure") Then
		
		ProcessPreparedData(ImportResult);
		Items.List.Refresh();
		ShowMessageBox(,NStr("en = 'Data import is complete.'"));
		
	ElsIf ImportResult = Undefined Then
		
		Items.List.Refresh();
		
	EndIf;
	
EndProcedure

&AtServer
Procedure ProcessPreparedData(ImportResult)
	
	DataImportFromExternalSourcesOverridable.ImportDataFromExternalSourceResultDataProcessor(ImportResult);
	
EndProcedure
// End StandardSubsystems.DataImportFromExternalSource

// StandardSubsystems.PerformanceMeasurement
&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Copy, Parent, Group)
	
	If Not Group Then
		KeyOperation = "FormCreatingProducts";
		PerformanceEstimationClientServer.StartTimeMeasurement(KeyOperation);
	EndIf;

EndProcedure

&AtClient
Procedure ListBeforeRowChange(Item, Cancel)
	
	If Not Item.CurrentData.IsFolder Then
		KeyOperation = "FormOpeningProducts";
		PerformanceEstimationClientServer.StartTimeMeasurement(KeyOperation);
	EndIf;
	
EndProcedure

// End StandardSubsystems.PerformanceMeasurement

#EndRegion
